import type { Beverage } from '.';

export const beverages: DeepReadonly<Beverage[]> = [
  {
    name: '“大冰棍儿！”',
    price: 35,
    features: ['无酒精', '提神', '现代', '甘'],
    obtaining: '【联动】三妖精的蹦蹦跳跳讨伐大作战 【妖怪兽道】 购买',
    description:
      '简单又富有重量感的大冰块，有梦幻的甜蜜和薄荷的调味，夏天解暑、让所有人满血复活神奇冰品！是「三妖精的蹦蹦跳跳讨伐大作」战世界传来的珍贵饮品。',
  },
  {
    name: '阿芙加朵',
    price: 35,
    features: ['无酒精', '可加冰', '提神', '甘', '苦'],
    obtaining: '【红魔馆】 购买',
    description:
      '将冰淇淋融化在咖啡中的做法，对于怕苦又需要咖啡提神的人来说是再好不过的饮料。 “我只是需要提神，并不是怕苦。” ——帕秋莉',
  },
  {
    name: '冰山毛玉冻柠',
    price: 45,
    features: ['无酒精', '可加冰', '气泡', '提神', '水果', '直饮', '甘'],
    obtaining: '【其它】',
    description:
      '仿佛是融化在可口的冰沙中的毛玉，佐以冻柠口味，在炎热的夏季，不知拯救了多少人命，去 MC 幻想乡旅游过的客人这样评价:没喝过冰山毛玉冻柠，MC 幻想乡等于白去。',
  },
  {
    name: '波子汽水',
    price: 30,
    features: ['无酒精', '气泡', '现代'],
    obtaining: '【人类村落】 购买',
    description:
      '瓶口有弹珠的设计，只要向下按压将弹珠打入汽水内，引起二氧化碳的剧烈反应。此时将瓶中沸腾又冰冷的气泡一饮而尽的话，你会在胃中感受到整个夏天。',
  },
  {
    name: '超 ZUN 啤酒',
    price: 18,
    features: ['低酒精', '可加冰', '啤酒', '苦'],
    obtaining: '【人类村落】 购买',
    description:
      '某位和幻想乡很有渊源的大人物作为副业的产品，虽然是处于兴趣而研制的啤酒，但意外地十分有人气。',
  },
  {
    name: '大吟酿',
    price: 210,
    features: ['中酒精', '清酒', '古典', '可加冰', '水果', '直饮', '甘'],
    obtaining: '【妖怪之山(DLC1)】 购买',
    description:
      '最高级的清酒，口感极佳而且有水果的香味。必须避光，在太阳的照射下颜色会迅速变深。',
  },
  {
    name: '冬酿',
    price: 60,
    features: ['低酒精', '可加冰', '可加热', '古典', '甘'],
    obtaining: '【迷途竹林】 购买',
    description:
      '来自某个古国的习俗，在冬至日酿造的酒，色泽金黄，清甜甘冽，加上桂花的香气，无论冰着喝还是热着喝都非常可口。',
  },
  {
    name: '风祝',
    price: 130,
    features: ['中酒精', '可加冰', '鸡尾酒', '现代', '甘'],
    obtaining: '【博丽神社】 祈愿',
    description:
      '轻松愉快的餐后酒，薄荷和奶油为主的口感。比起酒精饮料更像甜品。 “好像是守矢的巫女从外面带过来的配方，堂而皇之地冠了自己的名字!说起来那家伙在外界能喝酒吗?啊，这玩意儿也完全不像酒就是了，怪不得她会喜欢，啧。” ——不愿透露姓名的巫女',
  },
  {
    name: '古法奶油冰沙 (DLC1)',
    price: 42,
    features: ['无酒精', '甘', '可加冰', '古典'],
    obtaining: '【妖怪之山】 购买',
    description:
      '河童们窖藏的天然冰块，和牛乳、糖等配料一起在铁通里打碎，加速搅拌得到的产物，是古法制造的冰激凌。虽然现世已经不再用这种传统方法制作，但在幻想乡作为特色依旧很受欢迎。',
  },
  {
    name: '古明地冰激凌 (DLC2)',
    price: 35,
    features: ['无酒精', '甘', '水果', '现代'],
    obtaining: '【地灵殿】 购买',
    description:
      '地灵殿的限定纪念甜品！以地灵殿的觉妖怪姐妹为原型设计的可爱甜筒，在地底妖怪中有很大的人气。',
  },
  {
    name: '鬼杀 (DLC2)',
    price: 320,
    features: ['高酒精', '可加冰', '烧酒', '辛', '古典'],
    obtaining: '【旧地狱】 购买',
    description:
      '传说一杯就能让酒量无底洞一般的贵族醉生梦死的传说之酒......但我见到的是......鬼明明都当作凉白开来喝的？！传说一点都不靠谱啊。',
  },
  {
    name: '果味 High Ball',
    price: 12,
    features: ['低酒精', '可加冰', '西洋酒', '鸡尾酒', '水果', '甘', '苦'],
    obtaining: '【妖怪兽道】 购买',
    description:
      '居酒屋常见的，使用威士忌和果汁，苏打勾兑的简单调酒，降低了酒精度之后成为了谁都可以享受的饮料。',
  },
  {
    name: '果味 SOUR',
    price: 12,
    features: ['低酒精', '可加冰', '烧酒', '鸡尾酒', '水果', '甘', '苦'],
    obtaining: '【妖怪兽道】 购买',
    description:
      '居酒屋常见的，使用烧酒和果汁，苏打勾兑的简单调酒，比起 HighBall 更加有日式风格。',
  },
  {
    name: '红魔馆红茶',
    price: 25,
    features: ['无酒精', '可加热', '提神', '水果'],
    obtaining: '【红魔馆】 购买',
    description:
      '使用柠檬，佛手柑，和女仆长精心挑选的红茶品种烘焙出带有独特香味的红茶饮料，为了扩张红魔馆的威严，非常普通地以红魔馆命名。',
  },
  {
    name: '红雾',
    price: 75,
    features: ['中酒精', '可加热', '西洋酒'],
    obtaining: '【红魔馆】 购买',
    description:
      '洋馆的女仆特制的红葡萄酒，酒体丰满，因为好像不是正常的时间下酿造出来的，总有一种雾气般的朦胧感。',
  },
  {
    name: '红柚果汁',
    price: 24,
    features: ['无酒精', '水果'],
    obtaining: '【人类村落】 购买',
    description:
      '据说是来自外界的人气饮料，用红色柚子这种水果榨汁，尤其是盛夏饮用，健康祛暑，让人回甘无穷。',
  },
  {
    name: '火鼠裘',
    price: 420,
    features: ['高酒精', '可加热', '烧酒', '辛'],
    obtaining: '【其它】',
    description:
      '如果不使用火鼠裘来承装也许就会烧起来的烈酒，几乎无人能承受其辣度的超级辣口烈酒。',
  },
  {
    name: '教父',
    price: 180,
    features: ['高酒精', '可加冰', '西洋酒', '鸡尾酒', '古典', '苦'],
    obtaining: '【红魔馆】 购买',
    description:
      '浓烈的北方威士忌和杏仁利口酒混合，非常古典的调酒。口感也相当硬汉，普通的妖怪应付不来。 “大小姐听说凶猛的妖怪喜欢喝这种，派我去学，喝完都快哭出了还要强作威严地说好喝.” ——不愿透露姓名的女仆长',
  },
  {
    name: '咖啡 (DLC1)',
    price: 62,
    features: ['无酒精', '苦', '现代', '可加热', '可加冰', '提神'],
    obtaining: '【魔法森林】 购买',
    description:
      '用现代磨制工艺将稀少的咖啡豆磨成粉末制成的饮品，能够奇妙的提升精神和集中力，是脑力劳动者不可或缺的神奇饮料。',
  },
  {
    name: '绿茶',
    price: 1,
    features: ['无酒精'],
    obtaining: '【初始】',
    description: '最普通的饮料，给一滴酒都不能沾的弱小妖怪准备的。',
  },
  {
    name: '梅酒',
    price: 32,
    features: ['中酒精', '可加冰', '可加热', '利口酒', '水果'],
    obtaining: '【人类村落】 购买',
    description:
      '人间之里的人类自酿的梅子酒，因为喝起来很甜，所以经常有不了解生物被它的后劲儿击倒。',
  },
  {
    name: '尼格罗尼',
    price: 100,
    features: ['中酒精', '可加冰', '西洋酒', '鸡尾酒', '水果', '苦'],
    obtaining: '【红魔馆】 购买',
    description:
      '微苦的橙味为主，香气扑鼻，入口柔顺。最近非常流行。 “听说现世很流行，大小姐派我去学，结果受不了苦味让我加大橙子和味美思的剂量，最后完全变成橙汁糖浆了…” ——不愿透露姓名的女仆长',
  },
  {
    name: '牛奶',
    price: 16,
    features: ['无酒精', '直饮'],
    obtaining: '【人类村落】 购买',
    description: '温润纯白的饮品，无论小孩还是大人都适合引用，好处多到说不完。',
  },
  {
    name: '普通健身茶 (DLC1)',
    price: 210,
    features: ['中酒精', '苦', '气泡', '利口酒'],
    obtaining: '【魔法森林】 购买',
    description:
      '魔女研制的药茶，据说瘦身功效拔群。标签上写着“喝掉我”，虽然有点可疑但它神奇的丰富味道着实令人惊叹。',
  },
  {
    name: '淇',
    price: 18,
    features: ['低酒精', '可加冰', '清酒', '鸡尾酒', '气泡', '甘', '辛', '苦'],
    obtaining: '【妖怪兽道/人类村落】 购买',
    description:
      '在加入了大量的苏打后，这种起泡清酒酸甜的口感，以及较低的酒精度，使其很受女性的欢迎；可以说是清酒的香槟版本。',
  },
  {
    name: '麒麟 (DLC3)',
    price: 180,
    features: ['啤酒', '中酒精', '直饮'],
    obtaining: '【道场】 购买',
    description:
      '道士们采用外界的技术，只提取第一道麦汁酿造的啤酒，因此没有一般瓶酒的涩味，口感更纯更顺。',
  },
  {
    name: '气保健 (DLC2)',
    price: 45,
    features: ['无酒精', '甘', '直饮', '提神'],
    obtaining: '【地灵殿】 购买',
    description:
      '河童贩卖的外面世界某种提神功能性饮料的山寨品，据说提取了主要成分、换个名字谁都可以制作......但这样真的没问题吗？',
  },
  {
    name: '雀酒',
    price: 50,
    features: ['中酒精', '可加冰', '可加热', '清酒', '辛'],
    obtaining: '【妖怪兽道】 采集',
    description:
      '传说中由麻雀酿的酒。将米粒藏入截断的竹中，当竹中有水时，日经月累便成佳酿。据说喝了此酒会舞无休止，是带着“诅咒”的美味呢。',
  },
  {
    name: '日月星',
    price: 34,
    features: ['中酒精', '可加冰', '可加热', '清酒', '直饮'],
    obtaining: '【人类村落】 购买',
    description:
      '纯米酒，有着妖精的祝福。度数不高，口感柔顺，价格平易近人，是居酒屋受欢迎的选择。',
  },
  {
    name: '神之麦',
    price: 45,
    features: ['中酒精', '可加冰', '可加热', '烧酒', '直饮'],
    obtaining: '【博丽神社】 购买',
    description: '使用妖怪之山上被秋天的神明们所庇佑的大麦所酿造的大麦烧酒。',
  },
  {
    name: '十四夜',
    price: 440,
    features: ['中酒精', '可加冰', '可加热', '清酒', '古典', '甘'],
    obtaining: '【迷途竹林】 购买',
    description:
      '比起十五夜的月亮是满月，也许更想留下十四夜时期待的心情。以这样的感觉酿造的高级清酒，也许只有它才配得上迷途竹林所见到的月亮吧。',
  },
  {
    name: '水獭祭',
    price: 130,
    features: ['中酒精', '可加冰', '可加热', '清酒', '直饮'],
    obtaining: '【妖怪兽道】 采集',
    description:
      '鬼杰组的战利品之一，因为水獭灵把敌组的战利品摆在地上的样子仿佛祭典，于是随便取的名字。实际上好像是相当高级的纯米大吟酿。',
  },
  {
    name: '天狗踊',
    price: 70,
    features: ['高酒精', '可加冰', '可加热', '清酒', '直饮'],
    obtaining: '【博丽神社】 购买',
    description:
      '传说连天狗喝了也会开心地跳舞的美味清酒，在妖怪之山开一次店就可以验证了吧。不同于其他无色的清酒，带有淡淡的琥珀色。',
  },
  {
    name: '晓',
    price: 400,
    features: ['高酒精', '可加冰', '西洋酒', '直饮'],
    obtaining: '【博丽神社】 购买',
    description:
      '针对幻想乡居民口味改良的威士忌，在保留威士忌独有的气味的同时也有着顺滑的口感。',
  },
  {
    name: '猩红恶魔',
    price: 45,
    features: ['低酒精', '可加冰', '鸡尾酒'],
    obtaining: '【博丽神社】 购买',
    description:
      '由伏特加、番茄汁、柠檬片、芹菜根混合调制，甜、酸、苦、辣四味俱全。因血红的颜色让人联想到某洋馆的吸血鬼，故得此名。',
  },
  {
    name: '杨枝甘露 (DLC3)',
    price: 50,
    features: ['无酒精', '可加冰', '水果'],
    obtaining: '【命莲寺】 购买',
    description:
      '命莲寺特产。传说观音菩萨右手持杨枝，左手持盛有甘露的净瓶，用杨柳枝洒下甘露会带来好运。许多慕名而来的信徒都会饮上一杯。',
  },
  {
    name: '妖精雨露 (DLC1)',
    price: 80,
    features: ['无酒精', '甘', '可加冰'],
    obtaining: '【魔法森林】 购买',
    description:
      '妖精们采集露水、和花蜜混合的甘甜饮料。由于妖精们会忘记自己的劳动产品，所以常被动物或者人类采走。传说可以治愈百病甚至起死回生，但似乎是谣言。',
  },
  {
    name: '玉露茶',
    price: 50,
    features: ['无酒精', '可加热', '古典'],
    obtaining: '符卡、索取、交换等',
    description:
      '几乎是日本茶中最高级的茶叶，需要用较低的水温来冲泡，甘醇飘香，口感独特。',
  },
  {
    name: '月面火箭',
    price: 45,
    features: ['无酒精', '可加冰', '现代', '气泡'],
    obtaining: '【迷途竹林】 采集',
    description:
      '使用月之都先进技术制作的高级气泡水，迸发的口感有如火箭一般，只需要加一片柠檬就是完美的饮品。',
  },
];
